## Series - 1D Labeled Array

In [1]:
import pandas as pd

In [5]:
s1=pd.Series([435,5,25,3,5,23,53])

In [7]:
type(s1)

pandas.core.series.Series

In [9]:
s1

0    435
1      5
2     25
3      3
4      5
5     23
6     53
dtype: int64

In [16]:
s2 = pd.Series([43,5,3],index=["a","b","c"])

In [18]:
s2

a    43
b     5
c     3
dtype: int64

In [20]:
s2["b"]

5

## DataFrame - 2D Labeled Table(2D table with rows + columns)

In [27]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [29]:
df = pd.DataFrame(data)
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [31]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [41]:
df.columns

Index(['name', 'age', 'city'], dtype='object')

# Creating DataFrames

## From Python Lists

In [56]:
data = [['ab',34],["abc",47],["afs",43]]
data

[['ab', 34], ['abc', 47], ['afs', 43]]

In [58]:
pd.DataFrame(data,columns=["Name","Marks"])

  Name  Marks
0   ab     34
1  abc     47
2  afs     43

## From Dictionary

In [61]:
 data = {"a":[4,5,3],"b":[53,54,24]}

In [63]:
data

{'a': [4, 5, 3], 'b': [53, 54, 24]}

In [65]:
df = pd.DataFrame(data)

In [67]:
df

   a   b
0  4  53
1  5  54
2  3  24

## From NumPy Array

In [74]:
import numpy as np
arr = np.array([[1,2],[3,5]])

In [76]:
df = pd.DataFrame(arr,columns=["A","B"])

In [78]:
df

   A  B
0  1  2
1  3  5

## Read Data through Excel

In [93]:
df=pd.read_excel("testdata.xlsx")
df

      Name School  Marks
0  shubham      F     85
1   joshua    sGF     84
2     jack     sf     96
3    alexx     es      8
4  jasmine     af      2
5    rishi    dge     36
6   aakash    sag     85
7    mohan   sesa     96

## through CSV

In [99]:
df = pd.read_csv("datacsv.csv")
df

      Name School  Marks
0  shubham      F     85
1   joshua    sGF     84
2     jack     sf     96
3    alexx     es      8
4  jasmine     af      2
5    rishi    dge     36
6   aakash    sag     85
7    mohan   sesa     96

## Through JSON

In [114]:
df = pd.read_json("dataJson.json")
df

    Name Language
0  xyzzy   Python
1   zhfs      C++

## Through URL

In [117]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# EDA

In [120]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [122]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [126]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [128]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [132]:
df.shape

(244, 7)

## Through SQL

In [137]:
'''
import sqlite3

conn = sqlite3.connect("mydb.sqlite")
df = pd.read_sql("Select * from users",conn)
'''

'\nimport sqlite3\n\nconn = sqlite3.connect("mydb.sqlite")\ndf = pd.read_sql("Select * from users",conn)\n'